## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_billing_budget.my-cap-billing-budget will be updated in-place
!   resource "google_billing_budget" "my-cap-billing-budget" {
        id              = "billingAccounts/015525-9D090C-CC8778/budgets/542e848a-7a1f-4670-981f-08f6e8816d54"
        name            = "542e848a-7a1f-4670-981f-08f6e8816d54"
        # (2 unchanged attributes hidden)

!       amount {
            # (1 unchanged attribute hidden)

!           specified_amount {
!               units         = "1000" -> "300"
                # (2 unchanged attributes hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # google_secret_manager_secret.github-token will be created
+   resource "google_secret_manager_secret" "github-token" {
+       create_time = (known after apply)
+       expire_time = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       project     = (known after apply)
+       secret_id   = "github-token"

+       replication {
+           automatic = true
        }
    }

  # google_secret_manager_secret_version.github-token will be created
+   resource "google_secret_manager_secret_version" "github-token" {
+       create_time  = (known after apply)
+       destroy_time = (known after apply)
+       enabled      = true
+       id           = (known after apply)
+       name         = (known after apply)
+       secret       = (known after apply)
+       secret_data  = (sensitive value)
    }

  # google_storage_bucket_object.my-cap-billing-archive must be replaced
-/+ resource "google_storage_bucket_object" "my-cap-billing-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "ZycKzg==" -> (known after apply)
!       detect_md5hash   = "5TH86IWKkoKtsPVEM2ktgw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "cb9078f6-88df-1a37-c39e-fd1a8f2a2b23-function-source.zip" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "5TH86IWKkoKtsPVEM2ktgw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/cb9078f6-88df-1a37-c39e-fd1a8f2a2b23/o/function-source.zip?generation=1663223995832008&alt=media" -> (known after apply)
-       metadata         = {} -> null
        name             = "function-source.zip"
!       output_name      = "function-source.zip" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/cb9078f6-88df-1a37-c39e-fd1a8f2a2b23/o/function-source.zip" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.06 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.06 | 0.06|
| | **Total** | **0.00** | **0.06** | **0.06** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
